app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Virat Kohli"], ["body", "dependent: :destroy"], ["created_at", "2021-08-26 09:30:28.137392"], ["updated_at", "2021-08-26 09:30:28.137392"], ["status", "private"]]