app/controllers/comments_controller.rb

    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["article_id", 4], ["created_at", "2021-08-26 09:30:42.871609"], ["updated_at", "2021-08-26 09:30:42.871609"], ["status", "private"]]